;; -*- no-byte-compile: t; -*-
;;; ~/.doom.d/packages.el

;;; Examples:
;; (package! some-package)
;; (package! another-package :recipe (:fetcher github :repo "username/repo"))
;; (package! builtin-package :disable t)
(package! easy-hugo)
(package! wakatime-mode)
(package! presentation)
(package! org-jira)
(package! org-modern)
(package! command-log-mode)
(package! just-mode)
(package! good-scroll)
