;; -*- no-byte-compile: t; -*-
;;; ~/.doom.d/packages.el

;;; Examples:
;; (package! some-package)
;; (package! another-package :recipe (:fetcher github :repo "username/repo"))
;; (package! builtin-package :disable t)
(package! org-super-agenda)
(package! easy-hugo)
(package! writeroom-mode)
(package! org-super-agenda)
(package! org-fancy-priorities)
(package! wakatime-mode)
(package! presentation)
(package! org-jira)
(package! floobits)
(package! docker)
(package! command-log-mode)
